#Область JIRA

Функция JIRA_НайтиСоздатьСотрудника(Данные) Экспорт
	
	Если Данные = Неопределено Тогда
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	НайденнаяСсылка = Справочники.Сотрудники.НайтиПоКоду(Данные["name"]);
	Если НЕ ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		НовыйОбъект = Справочники.Сотрудники.СоздатьЭлемент();
		НовыйОбъект.Код = 			Данные["name"];
		НовыйОбъект.Наименование = 	Данные["displayName"];
		
		НовыйОбъект.Записать();
		
		НайденнаяСсылка = НовыйОбъект.Ссылка;
	КонецЕсли;
	
	Возврат НайденнаяСсылка;
	
КонецФункции

#КонецОбласти
