
Функция НайтиСоздатьКатегориюСтатуса(Данные) Экспорт
	
	Если Данные = Неопределено Тогда
		Возврат Справочники.JIRA_КатегорииСтатусов.ПустаяСсылка();
	КонецЕсли;
	
	НайденнаяСсылка = Справочники.JIRA_КатегорииСтатусов.НайтиПоКоду(Данные["id"]);
	Если НЕ ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		НовыйОбъект = Справочники.JIRA_КатегорииСтатусов.СоздатьЭлемент();
		НовыйОбъект.Код = 			Данные["id"];
		НовыйОбъект.Наименование = 	Данные["name"];
		НовыйОбъект.Ключ = 		Данные["key"];
		
		НовыйОбъект.Записать();
		
		НайденнаяСсылка = НовыйОбъект.Ссылка;
	КонецЕсли;
	
	Возврат НайденнаяСсылка;
	
КонецФункции
