
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СчетчикОтчетов = 1;
	ПодключитьОбработчикОжидания("СформироватьОтчет",60,ложь);
	
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет() Экспорт
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Результат.Очистить();
	
	Если СчетчикОтчетов = 3 Тогда
		СчетчикОтчетов = 1;
	КонецЕсли;
	
	Если СчетчикОтчетов = 1 Тогда
		ОтчетОбъект = Отчеты.JIRA_УчетТрудозатрат.Создать();
		ОтчетОбъект.КлючВариантаНастроек = "ТрудозатратыПоБлокам";
		ОтчетОбъект.СкомпоноватьРезультат(Результат);
	ИначеЕсли СчетчикОтчетов = 2 Тогда
		ОтчетОбъект = Отчеты.JIRA_УчетТрудозатрат.Создать();
		ОтчетОбъект.КлючВариантаНастроек = "ТрудозатратыТоп";
		ОтчетОбъект.СкомпоноватьРезультат(Результат);
	КонецЕсли;
	
	СчетчикОтчетов = СчетчикОтчетов + 1;
КонецПроцедуры
