
Процедура ВыполнитьЗагрузкуНаСервере() Экспорт
	
	Сообщить(ТекущаяДата());
	ПринудительнаяЗагрузка = Константы.JIRA_ПринудительнаяЗагрузкаДанных.Получить();
	
	ТекстJQLЗапроса = JQLЗапрос.JQLЗапрос;
	СписокЗадач = JIRA_ВзаимодействиеC_JIRA_КлиентСервер.ВыполнитьJQLЗапрос(ТекстJQLЗапроса, Истина);
	
	Для каждого Задача из СписокЗадач цикл
		
		ЗадачаСсылка = Справочники.JIRA_Задачи.НайтиСоздатьЗадачу(Задача, ПринудительнаяЗагрузка);
		
	КонецЦикла;
	
	Сообщить(ТекущаяДата());
	
КонецПроцедуры

