
Функция НайтиСоздатьСтатус(Данные) Экспорт
	
	Если Данные = Неопределено Тогда
		Возврат Справочники.JIRA_Статусы.ПустаяСсылка();
	КонецЕсли;
	
	НовыйОбъект = Неопределено;
	НайденнаяСсылка = Справочники.JIRA_Статусы.НайтиПоКоду(Данные["id"]);
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Если НайденнаяСсылка.КатегорияСтатуса = Справочники.JIRA_КатегорииСтатусов.ПустаяСсылка() 
			И Данные["statusCategory"] <> Неопределено Тогда
			НовыйОбъект = НайденнаяСсылка.ПолучитьОбъект();
		КонецЕсли;
	Иначе
		НовыйОбъект = Справочники.JIRA_Статусы.СоздатьЭлемент();		
	КонецЕсли;
	
	Если НовыйОбъект <> Неопределено Тогда
		НовыйОбъект.Код = 			Данные["id"];
		НовыйОбъект.Наименование = 	Данные["name"];
		
		Если Данные["description"] <> Неопределено Тогда
			НовыйОбъект.Описание = 		Данные["description"];
		КонецЕсли;
		
		Если Данные["statusCategory"] <> Неопределено Тогда
			НовыйОбъект.КатегорияСтатуса = Справочники.JIRA_КатегорииСтатусов.НайтиСоздатьКатегориюСтатуса(Данные["statusCategory"]);
		КонецЕсли;
		
		НовыйОбъект.Записать();
		
		НайденнаяСсылка = НовыйОбъект.Ссылка;
	КонецЕсли;
	
	Возврат НайденнаяСсылка;
	
КонецФункции
