
&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Константы.JIRA_JQLЗапросОбновленияДанных.Установить(JQLЗапросОбновленияДанных);
	Константы.JIRA_ПринудительнаяЗагрузкаДанных.Установить(ПринудительнаяЗагрузкаДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьНастроитьРегламентноеЗаданиеНажатие(Элемент)
	
	ИдентификаторЗадания = ПолучитьИдентификаторРегламентногоЗадания();
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИдентификаторЗадания", ИдентификаторЗадания);
	ОткрытьФорму("Обработка.КонсольЗаданий.Форма.ДиалогРегламентногоЗадания", СтруктураПараметров, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИдентификаторРегламентногоЗадания()
	
	Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.JIRA_ОбновлениеДанных);
	
	Возврат Задание.УникальныйИдентификатор;
	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	JQLЗапросОбновленияДанных = Константы.JIRA_JQLЗапросОбновленияДанных.Получить();
	ПринудительнаяЗагрузкаДанных = Константы.JIRA_ПринудительнаяЗагрузкаДанных.Получить();
КонецПроцедуры

