#Область ОбработчикиСобытийФормы


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФорм
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	ВыполнитьЗагрузкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере()
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ВыполнитьЗагрузкуНаСервере();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

	
#КонецОбласти


